# Membentuk dummy Data Frame

## Import Modules

In [1]:
import pandas as pd
import numpy as np

print("Pandas version:", pd.__version__,
      "\nNumPy version:", np.__version__)

Pandas version: 2.2.3
NumPy version: 2.1.3

## Membentuk Ddata Frame dari Dictionary

In [3]:
pd.DataFrame({'col1': [1, 2, 3, 4],
              'col2': [5, 6, 7, 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

## Membentuk Data Frame dari Numpy Array

In [12]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[ 8,  5, 12],
       [ 4,  1, 10],
       [12, 10, 17],
       [ 4,  3, 11],
       [17, 17, 15]], dtype=int32)

In [13]:
pd.DataFrame(arr, columns=tuple('ABC'))

    A   B   C
0   8   5  12
1   4   1  10
2  12  10  17
3   4   3  11
4  17  17  15

## Membentuk Data Frame dengan memanfataankan pandas.util.testing

In [15]:
# Pengganti pd.util.testing.makeDataFrame()
np.random.seed(42)  # Untuk reproducible results
n_rows, n_cols = 30, 4
data = np.random.randn(n_rows, n_cols)
index = pd.date_range('2000-01-01', periods=n_rows, freq='B')  # Business days
columns = list('ABCD')

df = pd.DataFrame(data, index=index, columns=columns)
df.head()

                   A         B         C         D
2000-01-03  0.496714 -0.138264  0.647689  1.523030
2000-01-04 -0.234153 -0.234137  1.579213  0.767435
2000-01-05 -0.469474  0.542560 -0.463418 -0.465730
2000-01-06  0.241962 -1.913280 -1.724918 -0.562288
2000-01-07 -1.012831  0.314247 -0.908024 -1.412304

In [16]:
# Pengganti pd.util.testing.makeTimeDataFrame()
np.random.seed(42)
dates = pd.date_range('2000-01-01', periods=100, freq='D')
data = np.random.randn(100, 4)
columns = ['A', 'B', 'C', 'D']

df_time = pd.DataFrame(data, index=dates, columns=columns)
df_time.head()

                   A         B         C         D
2000-01-01  0.496714 -0.138264  0.647689  1.523030
2000-01-02 -0.234153 -0.234137  1.579213  0.767435
2000-01-03 -0.469474  0.542560 -0.463418 -0.465730
2000-01-04  0.241962 -1.913280 -1.724918 -0.562288
2000-01-05 -1.012831  0.314247 -0.908024 -1.412304

In [17]:
# Pengganti pd.util.testing.makeMixedDataFrame()
np.random.seed(42)
data = {
    'A': np.random.randn(5),
    'B': np.random.randint(1, 100, 5),
    'C': ['foo', 'bar', 'baz', 'qux', 'quux'],
    'D': pd.date_range('2000-01-01', periods=5),
    'E': [True, False, True, False, True]
}

df_mixed = pd.DataFrame(data)
df_mixed.head()

          A   B     C          D      E
0  0.496714  75   foo 2000-01-01   True
1 -0.138264  75   bar 2000-01-02  False
2  0.647689  88   baz 2000-01-03   True
3  1.523030  24   qux 2000-01-04  False
4 -0.234153   3  quux 2000-01-05   True

In [18]:
# Pengganti pd.util.testing.makeMissingDataFrame()
np.random.seed(42)
data = np.random.randn(10, 4)
# Randomly insert NaN values
mask = np.random.random((10, 4)) < 0.2  # 20% missing data
data[mask] = np.nan

df_missing = pd.DataFrame(data, columns=list('ABCD'))
df_missing.head()

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137       NaN       NaN
2       NaN  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4       NaN  0.314247       NaN -1.412304